Repository: sun-jiao/flut-renamer
Catalog: lib/arb/intl_*.arb
Languages: ar, de, es, fr, it, ja, pt, th, tr

# appName
source: Renamer
ar: إعادة تسمية مجماعة
de: Flut Renamer
es: Flut Renamer
fr: Flut Renamer
it: Flut Renamer
ja: Flut Renamer
pt: Flut Renamer
th: Flut Renamer
tr: Flut Renamer

# lowercaseAppName
source: renamer
ar: إعادة تسمية مجماعة
de: flut renamer
es: flut renamer
fr: flut renamer
it: flut renamer
ja: flut renamer
pt: flut renamer
th: flut renamer
tr: flut renamer

source: OK
ar: موافق
es: Aceptar
th: ตกลง
tr: Tamam

source: Cancel
ar: إلغاء
de: Abbrechen
es: Cancelar
fr: Annuler
it: Annulla
ja: キャンセル
pt: Cancelar
th: ยกเลิก
tr: İptal

source: Exit
ar: خروج
de: Beenden
es: Salir
fr: Quitter
it: Esci
ja: 終了
pt: Sair
th: ออก
tr: Çıkış

source: Save
ar: حفظ
de: Speichern
es: Guardar
fr: Enregistrer
it: Salva
ja: 保存
pt: Salvar
th: บันทึก
tr: Kaydet

source: Add
ar: إضافة
de: Hinzufügen
es: Agregar
fr: Ajouter
it: Aggiungi
ja: 追加
pt: Adicionar
th: เพิ่ม
tr: Ekle

# permissionTitle
source: Permission for external storage
ar: إذن التخزين الخارجي
de: Externe Speicherberechtigung
es: Permiso de almacenamiento externo
fr: Autorisation pour le stockage externe
it: Permesso di archiviazione esterna
ja: 外部ストレージの許可
pt: Permissão de armazenamento externo
th: การอนุญาตให้เข้าถึงพื้นที่จัดเก็บภายนอก
tr: Dış Depolama İzni

# permissionContent
source: To provide you with our file renaming service, we need your permission to manage external storage. This allows us to access and rename files stored on your device. Without this permission, the app won't be able to access the complete file paths and therefore can't rename files. We assure you that your privacy and security are our top priorities, and we only access files for the purpose of renaming.
ar: لتوفير خدمة إعادة تسمية الملفات، نحتاج إلى إذنك لإدارة التخزين الخارجي. هذا يتيح لنا الوصول وإعادة تسمية الملفات المخزنة على جهازك. بدون هذا الإذن، لن يكون بإمكان التطبيق الوصول إلى المسار الكامل للملفات، وبالتالي لن يتمكن من إعادة تسميتها. نؤكد لك أننا نهتم بخصوصيتك وأمانك، وسنقوم بالوصول إلى الملفات فقط لأغراض إعادة التسمية.
de: Um den Dateiumbenennungsdienst bereitzustellen, benötigen wir Ihre Erlaubnis zur Verwaltung des externen Speichers. Dadurch können wir auf die auf Ihrem Gerät gespeicherten Dateien zugreifen und sie umbenennen. Ohne diese Berechtigung kann die App nicht auf den vollständigen Pfad der Dateien zugreifen und somit keine Umbenennung durchführen. Wir versichern Ihnen, dass wir Ihre Privatsphäre und Sicherheit sehr ernst nehmen und nur zum Zwecke der Umbenennung auf die Dateien zugreifen.
es: Para ofrecer el servicio de renombrar archivos, necesitamos que nos autorices a administrar el almacenamiento externo. De esta manera, podremos acceder y renombrar los archivos almacenados en tu dispositivo. Sin este permiso, la aplicación no podrá acceder a la ruta completa de los archivos, lo que impedirá la operación de renombrar. Te aseguramos que valoramos mucho tu privacidad y seguridad, y solo accederemos a los archivos con el propósito de renombrarlos.
fr: Pour vous fournir notre service de renommage de fichiers, nous avons besoin de votre autorisation pour gérer le stockage externe. Cela nous permet d'accéder et de renommer les fichiers stockés sur votre appareil. Sans cette autorisation, l'application ne pourra pas accéder aux chemins d'accès complets des fichiers et donc ne pourra pas les renommer. Nous vous assurons que votre vie privée et votre sécurité sont nos principales priorités, et nous n'accédons aux fichiers que dans le but de les renommer.
it: Per fornire il servizio di rinomina dei file, è necessario concedere l'autorizzazione per la gestione dell'archiviazione esterna. Ciò ci consente di accedere e rinominare i file archiviati sul dispositivo. Senza questo permesso, l'app non potrà accedere al percorso completo dei file e non potrà eseguire operazioni di rinomina. Ti assicuriamo che trattiamo la tua privacy e sicurezza con la massima attenzione e accediamo ai file solo per lo scopo di rinominarli.
ja: ファイルのリネームサービスを提供するために、外部ストレージの管理を許可してください。これにより、デバイスに保存されているファイルにアクセスしてリネームできるようになります。この許可がない場合、アプリはファイルの完全なパスにアクセスできないため、リネーム操作を行うことができません。お客様のプライバシーとセキュリティを非常に重視しており、リネーム目的でのみファイルにアクセスします。
pt: Para fornecer o serviço de renomeação de arquivos, precisamos da sua autorização para gerenciar o armazenamento externo. Isso nos permitirá acessar e renomear os arquivos armazenados no seu dispositivo. Sem essa permissão, o aplicativo não poderá acessar o caminho completo do arquivo e, portanto, não poderá renomeá-lo. Garantimos que valorizamos muito sua privacidade e segurança e só acessaremos os arquivos com o propósito de renomeação.
th: เพื่อให้บริการการเปลี่ยนชื่อไฟล์ เราต้องขออนุญาตให้เข้าถึงพื้นที่จัดเก็บภายนอกของคุณ นี้จะช่วยให้เราเข้าถึงและเปลี่ยนชื่อไฟล์ที่เก็บบนอุปกรณ์ของคุณ หากไม่มีการอนุญาตนี้แอปจะไม่สามารถเข้าถึงเส้นทางของไฟล์ได้อย่างสมบูรณ์ซึ่งทำให้ไม่สามารถดำเนินการเปลี่ยนชื่อได้ พวกเราขอรับประกันว่าเราใส่ใจความเป็นส่วนตัวและความปลอดภัยของคุณอย่างสูงและเราจะเข้าถึงไฟล์เพียงเท่าที่จำเป็นเพื่อการเปลี่ยนชื่อ
tr: Dosya yeniden adlandırma hizmetini sunabilmemiz için dış depolama yönetimi iznine ihtiyacımız var. Böylece cihazınızda depolanan dosyalara erişebilir ve yeniden adlandırabiliriz. Bu izin olmadan uygulama dosyaların tam yoluna erişemeyecek ve dolayısıyla yeniden adlandırma işlemi yapılamayacak. Gizliliğinize ve güvenliğinize büyük önem verdiğimizi temin ederiz, sadece yeniden adlandırma amacıyla dosyalara erişeceğiz.

# exitTitle
source: Cannot access external storage
ar: تعذر الوصول إلى التخزين الخارجي
de: Kein Zugriff auf den externen Speicher
es: No se puede acceder al almacenamiento externo
fr: Impossible d'accéder au stockage externe
it: Impossibile accedere all'archiviazione esterna
ja: 外部ストレージにアクセスできません
pt: Impossível acessar o armazenamento externo
th: ไม่สามารถเข้าถึงพื้นที่จัดเก็บภายนอกได้
tr: Dış Depolama Erişilemiyor

# exitContent
source: The manage external storage permission allows us to access and rename files stored on your device. Without this permission, the app won't be able to access the complete file paths and therefore can't rename files. Please go to the Settings page and grant the permission manually; otherwise, we cannot provide any service.
ar: يسمح إذن إدارة التخزين الخارجي لنا بالوصول إلى الملفات المخزنة على جهازك وإعادة تسميتها. بدون هذا الإذن، لن يكون بإمكان التطبيق الوصول إلى المسار الكامل للملفات، وبالتالي لن يتمكن من إعادة تسميتها. يرجى الانتقال إلى الإعدادات ومنح الإذن يدويًا، وإلا لن نتمكن من تقديم أي خدمة.
de: Die Berechtigung zur Verwaltung des externen Speichers ermöglicht uns den Zugriff auf die auf Ihrem Gerät gespeicherten Dateien und deren Umbenennung. Ohne diese Berechtigung kann die App nicht auf den vollständigen Pfad der Dateien zugreifen und somit keine Umbenennung durchführen. Bitte gehen Sie manuell zu den Einstellungen und gewähren Sie die Berechtigung, sonst können wir keine Dienste anbieten.
es: El permiso para administrar el almacenamiento externo nos permite acceder y renombrar los archivos almacenados en tu dispositivo. Sin este permiso, la aplicación no podrá acceder a la ruta completa de los archivos, lo que impedirá la operación de renombrar. Por favor, ve a la página de configuración y otorga el permiso manualmente, de lo contrario no podremos ofrecerte ningún servicio.
fr: L'autorisation de gestion du stockage externe nous permet d'accéder et de renommer les fichiers stockés sur votre appareil. Sans cette autorisation, l'application ne pourra pas accéder aux chemins d'accès complets des fichiers et donc ne pourra pas les renommer. Veuillez vous rendre dans les paramètres et accorder manuellement l'autorisation ; sinon, nous ne pourrons fournir aucun service.
it: Il permesso di gestione dell'archiviazione esterna ci consente di accedere e rinominare i file archiviati sul tuo dispositivo. Senza questo permesso, l'app non potrà accedere al percorso completo dei file e non potrà eseguire operazioni di rinomina. Vai alle impostazioni e concedi manualmente il permesso, altrimenti non saremo in grado di fornire alcun servizio.
ja: 外部ストレージの管理権限は、デバイスに保存されているファイルにアクセスしてリネームするために必要です。この許可がない場合、アプリはファイルの完全なパスにアクセスできないため、リネーム操作を行うことができません。設定ページに移動して、手動で権限を付与してください。そうしないと、サービスを提供できません。
pt: A permissão para gerenciar o armazenamento externo permite que acessemos e renomeemos os arquivos armazenados no seu dispositivo. Sem essa permissão, o aplicativo não poderá acessar o caminho completo do arquivo e, portanto, não poderá renomeá-lo. Por favor, vá para as configurações e conceda a permissão manualmente, caso contrário, não seremos capazes de fornecer nenhum serviço.
th: การอนุญาตให้เข้าถึงพื้นที่จัดเก็บภายนอกช่วยให้เราเข้าถึงและเปลี่ยนชื่อไฟล์ที่เก็บบนอุปกรณ์ของคุณ หากไม่มีการอนุญาตนี้แอปจะไม่สามารถเข้าถึงเส้นทางของไฟล์ได้อย่างสมบูรณ์ซึ่งทำให้ไม่สามารถดำเนินการเปลี่ยนชื่อได้ กรุณาไปที่หน้าการตั้งค่าเพื่อให้สิทธิ์ด้วยตนเอง มิฉะนั้นเราจะไม่สามารถให้บริการใด ๆ
tr: Dış depolama yönetimi izni, cihazınızdaki dosyalara erişmemizi ve onları yeniden adlandırmamızı sağlar. Bu izin olmadan uygulama dosyaların tam yoluna erişemeyecek ve dolayısıyla yeniden adlandırma işlemi yapılamayacak. Lütfen ayarlara gidip izni manuel olarak verin, aksi takdirde herhangi bir hizmet sağlayamayacağız.

# iosRemindTitle
source: About picking files on iOS
ar: حول تحديد الملفات على iOS
de: Dateiauswahl auf iOS
es: Sobre la selección de archivos en iOS
fr: À propos de la sélection des fichiers sur iOS
it: Selezione dei file su iOS
ja: iOSでのファイル選択について
pt: Sobre a seleção de arquivos no iOS
th: เกี่ยวกับการเลือกไฟล์บน iOS
tr: iOS'ta Dosya Seçimi Hakkında

# iosRemindContent
source: To pick files on iOS, first choose the directory where your files are located. Then, within the selected folder, pick the files you want to rename. Due to the restrictions of iOS, we have to use a two-step process, which ensures safe file management. Let's get started!
ar: لتحديد الملفات على iOS، اختر أولاً مجلدًا يحتوي على الملفات الخاصة بك. ثم، في المجلد المحدد، حدد الملفات التي ترغب في إعادة تسميتها. بسبب قيود iOS، يتعين علينا اتباع هذين الخطوتين، مما يضمن الوصول الآمن إلى الملفات. دعنا نبدأ!
de: Um Dateien auf iOS auszuwählen, wählen Sie zunächst einen Ordner aus, der Ihre Dateien enthält. Wählen Sie dann in dem ausgewählten Ordner die Dateien aus, die Sie umbenennen möchten. Aufgrund von iOS-Beschränkungen müssen wir diese beiden Schritte durchführen, um einen sicheren Dateizugriff zu gewährleisten. Lass uns anfangen!
es: Para seleccionar archivos en iOS, primero elige una carpeta que contenga tus archivos. Luego, dentro de la carpeta seleccionada, elige los archivos que deseas renombrar. Debido a las limitaciones de iOS, debemos seguir estos dos pasos para garantizar el acceso seguro a los archivos. ¡Comencemos!
fr: Pour sélectionner des fichiers sur iOS, choisissez d'abord le répertoire où se trouvent vos fichiers. Ensuite, dans le dossier sélectionné, choisissez les fichiers que vous souhaitez renommer. En raison des restrictions d'iOS, nous devons procéder en deux étapes, ce qui garantit une gestion sécurisée des fichiers. Commençons !
it: Per selezionare i file su iOS, prima seleziona una cartella che contiene i tuoi file. Quindi, all'interno della cartella selezionata, scegli i file che desideri rinominare. A causa delle restrizioni di iOS, dobbiamo seguire questi due passaggi per garantire un accesso sicuro ai file. Iniziamo!
ja: iOSでファイルを選択するには、まずファイルが含まれているフォルダを選択します。次に、選択したフォルダからファイルを選択します。iOSの制限のため、これらの2つのステップが必要で、安全なファイルアクセスが確保されます。さあ、始めましょう！
pt: Para selecionar arquivos no iOS, primeiro selecione uma pasta que contenha seus arquivos. Em seguida, dentro da pasta selecionada, escolha os arquivos que deseja renomear. Devido às limitações do iOS, precisamos seguir essas duas etapas para garantir o acesso seguro aos arquivos. Vamos começar!
th: เพื่อเลือกไฟล์บน iOS โปรดเลือกโฟลเดอร์ที่มีไฟล์ของคุณก่อน จากนั้นในโฟลเดอร์ที่เลือก เลือกไฟล์ที่ต้องการเปลี่ยนชื่อ จากข้อจำกัดของ iOS เราต้องทำขั้นตอนเหล่านี้เพื่อให้มั่นใจว่ามีการเข้าถึงไฟล์อย่างปลอดภัย มาเริ่มต้นเลย!
tr: iOS'ta dosya seçmek için öncelikle dosyalarınızı içeren bir klasör seçin. Ardından, seçtiğiniz klasörde yeniden adlandırmak istediğiniz dosyayı seçin. iOS'un kısıtlamaları nedeniyle bu iki adımı izlememiz gerekiyor, bu da dosyalara güvenli erişimi sağlar. Haydi başlayalım!

# androidRemindTitle
source: Rename directory
ar: إعادة تسمية الدلائل
de: Verzeichnis umbenennen
es: Renombrar directorios
fr: Renommer un répertoire
it: Rinomina directory
ja: ディレクトリのリネーム
pt: Renomear diretórios
th: เปลี่ยนชื่อโฟลเดอร์
tr: Klasör Yeniden Adlandırma

# androidRemindContent
source: Using the renamer, you can not only rename files but also directories. Long-press a directory to select it, then select 'Files & Dirs' from the drop-down button in the upper-left corner to enable directory renaming. For security reasons, some system reserved directories are not selectable.
ar: باستخدام إعادة التسمية بالجملة، يمكنك ليس فقط إعادة تسمية الملفات، ولكن يمكنك أيضًا إعادة تسمية الدلائل. اضغط مطولًا على المجلد لتحديده، ثم اختر "الملفات والدلائل" من الزر المنسدل في الزاوية اليسرى العلوية لتمكين وظيفة إعادة تسمية الدلائل. لأسباب أمان، قد تحتفظ بعض النظم بالدلائل الأساسية من التحديد.
de: Mit dem Flut Renamer können Sie nicht nur Dateien, sondern auch Verzeichnisse umbenennen. Drücken Sie lange auf ein Verzeichnis, um es auszuwählen, und wählen Sie dann 'Dateien & Verzeichnisse' aus dem Dropdown-Button in der oberen linken Ecke, um die Umbenennung von Verzeichnissen zu aktivieren. Aus Sicherheitsgründen sind einige systemreservierte Verzeichnisse nicht auswählbar.
es: Con el Flut Renamer, puede cambiar el nombre no solo de los archivos, sino también de los directorios. Mantenga presionado un directorio para seleccionarlo y luego seleccione 'Archivos y directorios' en el botón desplegable de la esquina superior izquierda para habilitar el cambio de nombre de directorios. Por razones de seguridad, algunos directorios reservados por el sistema no se pueden seleccionar.
fr: Avec le Flut Renamer, vous pouvez renommer non seulement les fichiers, mais aussi les répertoires. Appuyez longuement sur un répertoire pour le sélectionner, puis sélectionnez 'Fichiers et répertoires' dans le bouton déroulant situé dans le coin supérieur gauche pour activer le renommage des répertoires. Pour des raisons de sécurité, certains répertoires réservés au système ne sont pas sélectionnables.
it: Usando il Flut Renamer, puoi rinominare non solo i file, ma anche le directory. Tieni premuta una directory per selezionarla, quindi seleziona 'File e directory' dal pulsante a discesa nell'angolo in alto a sinistra per abilitare la rinomina delle directory. Per motivi di sicurezza, alcune directory riservate al sistema non sono selezionabili.
ja: Flut Renamerを使用すると、ファイルだけでなくディレクトリも名前を変更できます。ディレクトリを長押しして選択し、左上隅のドロップダウンボタンから「ファイルとディレクトリ」を選択してディレクトリの名前を変更できます。セキュリティ上の理由から、一部のシステム予約ディレクトリは選択できません。
pt: Usando o Flut Renamer, você pode renomear não apenas arquivos, mas também diretórios. Pressione e segure um diretório para selecioná-lo e, em seguida, selecione 'Arquivos e diretórios' no botão suspenso no canto superior esquerdo para habilitar a renomeação de diretórios. Por motivos de segurança, alguns diretórios reservados pelo sistema não são selecionáveis.
th: การใช้ Flut Renamer คุณสามารถเปลี่ยนชื่อไฟล์และไดเรกทอรีได้ กดค้างไดเรกทอรีเพื่อเลือก จากนั้นเลือก 'ไฟล์และไดเรกทอรี' จากปุ่มแบบเลื่อนลงที่มุมบนซ้ายเพื่อเปิดใช้งานการเปลี่ยนชื่อไดเรกทอรี เนื่องจากเหตุผลด้านความปลอดภัย บางไดเรกทอรีที่สงวนไว้สำหรับระบบจะไม่สามารถเลือกได้
tr: Flut Renamer'ı kullanarak sadece dosyaların değil, dizinlerin de adını değiştirebilirsiniz. Bir dizini seçmek için uzun basın, ardından dizin yeniden adlandırmayı etkinleştirmek için sol üst köşedeki açılır düğmeden 'Dosyalar ve Dizinler'i seçin. Güvenlik nedeniyle, bazı sistem ayrılmış dizinler seçilemez.

# doNotRemindAgain
source: OK. Do not remind me again.
ar: لا تذكر مرة أخرى
de: Nicht mehr erinnern
es: Aceptar, no volver a recordar
fr: OK. Ne plus me rappeler.
it: Non mostrare più
ja: 今後表示しない
pt: Não mostrar novamente
th: ตกลง ไม่ต้องเตือนอีก
tr: Tamam, Bir Daha Hatırlatma

source: Rename
ar: إعادة التسمية
de: Umbenennen
es: Renombrar
fr: Renommer
it: Rinomina
ja: リネーム
pt: Renomear
th: เปลี่ยนชื่อ
tr: Yeniden Adlandır

source: App info
ar: معلومات التطبيق
de: App-Information
es: Información de la aplicación
fr: Informations sur l'application
it: Informazioni sull'app
ja: アプリ情報
pt: Informações do aplicativo
th: ข้อมูลแอป
tr: Uygulama Bilgileri

# aboutContent
source: This application is designed to help users rename their files. It is built with Flutter - a multi-platform application framework, and therefore it is also available on other operating systems. It is totally open source and can be reviewed or contributed to.
ar: هذا التطبيق مصمم لمساعدة المستخدمين في إعادة تسمية الملفات. تم تطويره باستخدام إطار العمل Flutter، لذا فهو متوافق أيضًا مع أنظمة التشغيل الأخرى. إنه مفتوح المصدر بالكامل، ويمكن مراجعته والمساهمة فيه.
de: Diese App soll Benutzern beim Umbenennen von Dateien helfen. Sie wurde mit dem Flutter-Framework entwickelt und ist daher auch für andere Betriebssysteme geeignet. Sie ist vollständig Open Source und kann überprüft und verbessert werden.
es: Esta aplicación está diseñada para ayudar a los usuarios a renombrar archivos. Está desarrollada con el framework Flutter, por lo que también es compatible con otros sistemas operativos. Es completamente de código abierto y puede ser revisada y contribuida por cualquiera.
fr: Cette application est conçue pour aider les utilisateurs à renommer leurs fichiers. Elle est développée avec Flutter, un framework d'application multiplateforme, et est donc également disponible sur d'autres systèmes d'exploitation. Elle est totalement open source et peut être examinée ou contribuée.
it: Questa app è progettata per aiutare gli utenti a rinominare i file. È sviluppata utilizzando il framework Flutter, rendendola adatta anche per altri sistemi operativi. È completamente open source e può essere esaminata e contribuita liberamente.
ja: このアプリはファイルのリネームを支援するためのものです。Flutterフレームワークを使用して開発されており、他のオペレーティングシステムでも使用できます。完全にオープンソースであり、レビューおよび貢献が可能です。
pt: Este aplicativo destina-se a ajudar os usuários a renomear arquivos. Ele é desenvolvido com o framework Flutter, portanto, é compatível com outros sistemas operacionais. É totalmente open source, permitindo revisão e contribuição.
th: แอปนี้ถูกพัฒนาขึ้นเพื่อช่วยให้ผู้ใช้สามารถเปลี่ยนชื่อไฟล์ได้ มันถูกพัฒนาด้วย Flutter framework ซึ่งทำให้มันเหมาะสำหรับระบบปฏิบัติการอื่น ๆ ด้วย มันเป็นโปรเจ็กต์โอเพนซอร์สอย่างเต็มที่และสามารถตรวจสอบและมีส่วนร่วมได้
tr: Bu uygulama, kullanıcıların dosyaları yeniden adlandırmasına yardımcı olmayı amaçlamaktadır. Flutter çerçevesi kullanılarak geliştirilmiştir, bu nedenle diğer işletim sistemlerinde de kullanılabilir. Tamamen açık kaynaklıdır ve inceleme ve katkı sağlanabilir.

# rating
source: Rating the app
ar: تقييم التطبيق
de: App-Bewertung
es: Calificar la aplicación
fr: Noter l'application
it: Valutazione dell'app
ja: アプリ評価
pt: Avalie o aplicativo
th: การให้คะแนนแอป
tr: Uygulama Puanı

# ratingTitle
source: Rate Our App
ar: قيم تطبيقنا
de: Bewerten Sie unsere App
es: Califica nuestra aplicación
fr: Notez notre application
it: Valuta la nostra app
ja: アプリを評価する
pt: Avalie nosso aplicativo
th: ให้คะแนนแอปของเรา
tr: Uygulamamızı Değerlendirin

# ratingContent
source: Enjoying our app? Help us grow by giving it a quick rating on the store or GitHub. Your feedback means the world to us! Thanks for your support.
ar: هل أعجبك تطبيقنا؟ قم بتقييمنا في متجر التطبيقات أو قم بإعطاء إعجاب على GitHub لمساعدتنا على النمو. تعليقاتك مهمة لنا! شكرًا لدعمك.
de: Mögen Sie unsere App? Geben Sie uns eine gute Bewertung im App Store oder geben Sie auf GitHub einen Stern, um uns zu unterstützen. Ihr Feedback ist uns sehr wichtig! Vielen Dank für Ihre Unterstützung.
es: ¿Te gusta nuestra aplicación? Ayúdanos a crecer calificándonos en la tienda de aplicaciones o dándonos un like en GitHub. ¡Tu feedback es muy importante para nosotros! Gracias por tu apoyo.
fr: Vous aimez notre application ? Aidez-nous à grandir en lui donnant une note rapide sur le magasin d'applications ou sur GitHub. Vos commentaires nous sont précieux ! Merci pour votre soutien.
it: Ti piace la nostra app? Aiutaci a crescere lasciando una valutazione positiva sullo store o mettendo un like su GitHub. Il tuo feedback è estremamente importante per noi! Grazie per il supporto.
ja: 当アプリを気に入りましたか？アプリストアで評価していただくか、GitHubでスターを付けていただくと成長に役立ちます。お客様のフィードバックは非常に重要です。ご支援いただきありがとうございます。
pt: Está gostando do nosso aplicativo? Deixe uma avaliação na loja de aplicativos ou dê um like no GitHub para nos ajudar a crescer. Seu feedback é muito importante para nós! Obrigado pelo apoio.
th: ชอบแอปของเราหรือไม่? โปรดให้คะแนนดี ๆ ใน App Store หรือกดไลค์ใน GitHub เพื่อช่วยเราในการ成⻑ ความคิดเห็นของคุณมีความสำคัญอย่างยิ่งสำหรับเรา! ขอบคุณสำหรับการสนับสนุนของคุณ
tr: Uygulamamızı beğendiniz mi? Mağazada iyi bir puan vererek veya GitHub'da beğenerek bize destek olun. Geri bildiriminiz bizim için çok önemlidir! Desteğiniz için teşekkür ederiz.

# ratingStore
source: Rate the app on store
ar: قم بتقييم في المتجر
de: Im Store bewerten
es: Calificar en la tienda
fr: Noter l'application sur le magasin
it: Valuta su Store
ja: ストアで評価
pt: Avaliar na loja
th: ให้คะแนนใน Store
tr: Mağazada Puan Ver

# ratingGithub
source: Star it on Github
ar: أعط إعجابًا على GitHub
de: GitHub-Repository markieren
es: Dar like en GitHub
fr: Ajouter une étoile sur Github
it: Metti un like su GitHub
ja: GitHubでスターを付ける
pt: Curtir o repositório no GitHub
th: กดไลค์บน GitHub
tr: GitHub Deposuna Beğeni Ver

source: Source code
ar: الشيفرة المصدرية
de: Quellcode
es: Código fuente
fr: Code source
it: Codice sorgente
ja: ソースコード
pt: Código-fonte
th: โค้ดต้นฉบับ
tr: Kaynak Kodu

source: Collapse options
ar: طي الخيارات
de: Optionen ausblenden
es: Contraer opciones
fr: Réduire les options
it: Nascondi opzioni
ja: オプションを折りたたむ
pt: Recolher opções
th: ยุบตัวเลือก
tr: Seçenekleri Daralt

source: Expand options
ar: توسيع الخيارات
de: Optionen erweitern
es: Expandir opciones
fr: Développer les options
it: Espandi opzioni
ja: オプションを展開する
pt: Expandir opções
th: ขยายตัวเลือก
tr: Seçenekleri Genişlet

source: Only Selected
ar: إعادة تسمية الملفات المحددة فقط
de: Nur ausgewählte Dateien umbenennen
es: Renombrar solo los archivos seleccionados
fr: Uniquement les éléments sélectionnés
it: Rinomina solo i file selezionati
ja: 選択したファイルのみリネーム
pt: Renomear apenas os arquivos selecionados
th: เปลี่ยนชื่อเฉพาะไฟล์ที่เลือก
tr: Yalnızca Seçili Dosyaları Yeniden Adlandır

source: Remove renamed
ar: إزالة الملفات التي تمت إعادة تسميتها
de: Umbenannte Dateien entfernen
es: Eliminar archivos ya renombrados
fr: Supprimer les éléments renommés
it: Rimuovi i file già rinominati
ja: リネーム済みファイルを削除
pt: Remover arquivos renomeados
th: ลบไฟล์ที่เปลี่ยนชื่อแล้ว
tr: Yeniden Adlandırılan Dosyaları Kaldır

# removeRule
source: Remove this rule
ar: إزالة هذه القاعدة
de: Regel entfernen
es: Eliminar esta regla
fr: Supprimer cette règle
it: Rimuovi questa regola
ja: このルールを削除
pt: Remover esta regra
th: ลบกฏนี้
tr: Kuralı Kaldır

# removeRules
source: Remove rules after renaming
ar: إزالة جميع القواعد بعد الإعادة التسمية
de: Nach dem Umbenennen alle Regeln entfernen
es: Eliminar todas las reglas después de renombrar
fr: Supprimer toutes les règles après le renommage
it: Rimuovi tutte le regole dopo la rinomina
ja: リネーム後にすべてのルールを削除
pt: Remover todas as regras após renomear
th: ลบกฏทั้งหมดหลังจากเปลี่ยนชื่อ
tr: Yeniden Adlandırma Sonrası Tüm Kuralları Kaldır

source: Add Rule
ar: إضافة قاعدة
de: Regel hinzufügen
es: Agregar regla
fr: Ajouter une règle
it: Aggiungi regola
ja: ルールを追加
pt: Adicionar regra
th: เพิ่มกฏ
tr: Kural Ekle
