Repository: sun-jiao/flut-renamer
Catalog: lib/arb/intl_*.arb
Languages: ar, de, es, fr, it, ja, pt, th, tr

# semanticsFilesDropdownButton
source: . Select this item to restrict renaming targets.
ar: . حدد هذا الخيار لتحديد المجال الذي يقتصر فيه تغيير الاسم عليه
de: . Wählen Sie es aus, um die Umbenennungsziele auf diesen Bereich zu beschränken.
es: . Selecciona para limitar los objetivos de renombrar a este rango.
fr: . Sélectionnez ceci pour limiter les cibles de renommage à cette plage
it: . Seleziona per limitare la rinomina ai file selezionati
ja: 。この項目を選択して、リネーム対象をこの範囲に制限します。
pt: . Selecione isso para limitar os arquivos renomeados a este escopo
th: เลือกเพื่อจำกัดเป้าหมายการเปลี่ยนชื่อให้เฉพาะของส่วนนี้
tr: . Yeniden adlandırma hedefini bu kapsamda sınırlamak için bu öğeyi seçin

# semanticsReorderableList
source: This is the rule list, it is empty now. Click the 'Add rule' button to add one. Rules are executed sequentially. This list is reorderable, allowing you to move a rule up, down, and to the top or bottom. When the cursor is on a rule, use a vertical swipe gesture to switch between actions, and use a double click to execute the selected action.
ar: قائمة القواعد فارغة الآن. انقر فوق زر 'إضافة قاعدة' لإضافة واحدة. تُنفَّذ القواعد بالترتيب، ويمكن إعادة ترتيب هذه القائمة لتمكينك من تغيير ترتيب القواعد، ونقلها للأعلى أو للأسفل، أو تحريكها إلى الأعلى أو الأسفل. عند وضع المؤشر فوق القاعدة، استخدم اللمس الرأسي للتبديل بين الإجراءات المختلفة، واستخدم النقر المزدوج لتنفيذ الإجراء المحدد.
de: Die Regel-Liste ist derzeit leer. Klicken Sie auf "Regel hinzufügen", um eine Regel hinzuzufügen. Regeln werden sequenziell ausgeführt. Diese Liste kann neu angeordnet werden, sodass Sie Regeln nach oben, unten, an den Anfang oder das Ende verschieben können. Wenn der Cursor über einer Regel steht, verwenden Sie eine vertikale Wischgeste, um zwischen verschiedenen Aktionen zu wechseln, und doppelklicken Sie, um die ausgewählte Aktion auszuführen.
es: La lista de reglas está actualmente vacía. Haz clic en "Agregar regla" para agregar una. Las reglas se ejecutan secuencialmente. Esta lista se puede reordenar para mover las reglas hacia arriba, hacia abajo, al principio o al final. Cuando el cursor está sobre una regla, usa un gesto de deslizamiento vertical para alternar entre diferentes acciones y haz doble clic para ejecutar la acción seleccionada.
fr: La liste des règles est actuellement vide. Appuyez sur le bouton "Ajouter une règle" pour en ajouter une. Les règles sont exécutées dans l'ordre. Vous pouvez réorganiser cette liste en la faisant glisser vers le haut ou vers le bas, ou en la plaçant en haut ou en bas. Lorsque le curseur est sur une règle, faites défiler verticalement pour changer d'action, et double-cliquez pour sélectionner l'action.
it: La lista delle regole è attualmente vuota. Tocca "Aggiungi regola" per aggiungerne una. Le regole vengono eseguite in sequenza. È possibile riordinare la lista trascinando verso l'alto o il basso e spostando le regole in cima o in fondo. Tocca con due dita su una regola per attivare le azioni e tocca due volte per eseguire l'azione selezionata.
ja: ルールリストは現在空です。ルールは順番に実行されます。リストを並べ替えてルールを上下に移動したり、先頭や末尾に移動したりすることができます。ルールを選択した状態で、垂直スワイプジェスチャを使用して異なる操作を切り替え、ダブルクリックして選択した操作を実行します。
pt: A lista de regras está vazia agora. Clique em "Adicionar regra" para adicionar uma. As regras são executadas em ordem. Esta lista pode ser reordenada, permitindo mover as regras para cima ou para baixo, bem como movê-las para o topo ou para o final. Com o cursor sobre uma regra, use o gesto de rolagem vertical para alternar entre diferentes ações e clique duplo para executar a ação selecionada.
th: ลิสต์กฎว่างอยู่ คลิกปุ่ม "เพิ่มกฎ" เพื่อเพิ่ม กฎจะถูกปฏิบัติตามลำดับ ลิสต์นี้สามารถเรียงลำดับได้ใหม่ อนุญาตให้คุณย้ายกฎขึ้นหรือลง และเลื่อนมันไปที่ด้านบนหรือด้านล่าง เมื่อเอาเมาส์มาวางบนกฎ ใช้การเลื่อนแนวตั้งเพื่อสลับไปมาระหว่างการดำเนินการแต่ละอย่าง และใช้การคลิกสองครั้งเพื่อดำเนินการที่เลือก
tr: Kural listesi şu anda boş. Bir tane eklemek için 'Kural Ekle' düğmesine tıklayın. Kurallar sırayla uygulanır. Bu liste yeniden düzenlenebilir, böylece kuralları yukarı ve aşağı taşıyabilir, onları listenin başına veya sonuna taşıyabilirsiniz. Bir kural üzerindeyken, dikey kaydırma hareketleri arasında geçiş yapmak ve seçilen işlemi çift tıklayarak gerçekleştirmek için kullanın.

# semanticsOpenMetadataDialog
source: Double tap to open a dialog and select a metadata tag to be inserted.
ar: انقر مرتين لفتح مربع حوار واختيار العلامات الوصفية التي تريد إدراجها.
de: Doppelklicken Sie, um einen Dialog zu öffnen und Metadatentags auszuwählen, die eingefügt werden sollen.
es: Haz doble clic para abrir un cuadro de diálogo y seleccionar una etiqueta de metadatos para insertar.
fr: Double-cliquez pour ouvrir une boîte de dialogue et sélectionner une balise de métadonnées à insérer.
it: Tocca due volte per aprire un dialogo e selezionare un tag dei metadati da inserire.
ja: ダブルクリックしてダイアログを開き、挿入するメタデータタグを選択します。
pt: Clique duplo para abrir um diálogo e selecionar as tags de metadados a serem inseridas.
th: คลิกสองครั้งเพื่อเปิดหน้าต่างและเลือกแท็กเมตาดาต้าที่จะแทรก
tr: Açıklamak için çift tıklayın ve içinden eklemek istediğiniz meta veri etiketini seçin.

# semanticsMultipleActionsHint
source: , switch between actions by a vertical swipe gesture
ar: ، انقر للأعلى أو للأسفل للتبديل إلى إجراء آخر.
de: , blättern Sie nach oben oder unten, um weitere Aktionen anzuzeigen.
es: , desliza hacia arriba y hacia abajo para cambiar entre otras acciones.
fr: , faites défiler vers le haut ou vers le bas pour changer d'action.
it: , scorri su e giù per passare ad altre azioni.
ja: 上下にスワイプして他の操作に移動します。
pt: , role para cima ou para baixo para alternar entre outras ações.
th: เลื่อนขึ้นลงเพื่อเปลี่ยนการดำเนินการ
tr: , Diğer işlemlere geçmek için yukarı veya aşağı kaydırın.

# semanticSwitchNumberToStartAndToEnd
source: Switching counting direction between from the beginning and from the end, currently counting from {toEnd, select, true{the end} false{the beginning} other{}}
ar: تبديل اتجاه العد بين البداية والنهاية، حاليًا يتم العد من {toEnd, select, true{النهاية} false{البداية} other{}}
de: Wechseln der Zählrichtung zwischen vom Anfang und vom Ende, aktuell wird gezählt ab {toEnd, select, true{dem Ende} false{dem Anfang} other{}}
es: Cambiar la dirección de conteo entre desde el principio y desde el final, actualmente contando desde {toEnd, select, true{el final} false{el principio} other{}}
fr: Changement de direction de comptage entre du début et de la fin, comptant actuellement à partir de {toEnd, select, true{la fin} false{le début} other{}}
it: Cambiamento della direzione del conteggio tra dall'inizio e dalla fine, attualmente il conteggio da {toEnd, select, true{la fine} false{l'inizio} other{}}
ja: 開始から終わりまでの数え方を切り替え、現在は{toEnd, select, true{終わり} false{始まり} other{}}から数えています
pt: Alternar direção de contagem entre do início e do fim, atualmente contando a partir de {toEnd, select, true{o final} false{o início} other{}}
th: สลับทิศทางการนับระหว่างจากจุดเริ่มต้นและจากจุดสิ้นสุด ณ ปัจจุบันกำลังนับจาก {toEnd, select, true{จุดสิ้นสุด} false{จุดเริ่มต้น} other{}}
tr: Başlangıçtan ve sondan sayma yönünü değiştirme, şu anda {toEnd, select, true{son} false{başlangıç} other{}} sayımından
