Repository: sun-jiao/flut-renamer
Catalog: lib/arb/intl_*.arb
Languages: ar, de, es, fr, it, ja, pt, th, tr

source: Remove all
ar: إزالة الكل
de: Alles entfernen
es: Eliminar todo
fr: Tout supprimer
it: Rimuovi tutto
ja: すべて削除
pt: Remover tudo
th: ลบทั้งหมด
tr: Tümünü Kaldır

source: Replace
ar: استبدال
de: Ersetzen
es: Reemplazar
fr: Remplacer
it: Sostituisci
ja: 置換
pt: Substituir
th: แทนที่
tr: Değiştir

source: Remove
ar: إزالة
de: Entfernen
es: Eliminar
fr: Supprimer
it: Rimuovi
ja: 削除
pt: Remover
th: ลบ
tr: Kaldır

source: Insert
ar: إدراج
de: Einfügen
es: Insertar
fr: Insérer
it: Inserisci
ja: 挿入
pt: Inserir
th: แทรก
tr: Ekle

source: Increment
ar: زيادة
de: Inkrementieren
es: Incrementar
fr: Incrémenter
it: Incrementa
ja: 増加
pt: Incrementar
th: เพิ่ม
tr: Artır

source: Rearrange
ar: إعادة ترتيب
de: Neu anordnen
es: Reorganizar
fr: Réorganiser
it: Riordina
ja: 並べ替え
pt: Rearranjar
th: จัดเรียงใหม่
tr: Yeniden Sırala

source: Transliterate
ar: تحويل الحروف
de: Transliteration
es: Transliterar
fr: Translittérer
it: Traslittera
ja: 転写
pt: Transliterar
th: การถอดอักษร
tr: Harf Değiştirme

source: Truncate
ar: اقتصاص
de: Kürzen
es: Truncar
fr: Tronquer
it: Tronca
ja: 切り詰め
pt: Truncar
th: ตัด
tr: Kırp

source: Cancel All
ar: إلغاء الكل
de: Alle abbrechen
es: Cancelar todo
fr: Tout annuler
it: Annulla tutto
ja: すべてキャンセル
pt: Cancelar tudo
th: ยกเลิกทั้งหมด
tr: Tümünü İptal Et

source: Select
ar: تحديد
de: Auswählen
es: Seleccionar
fr: Sélectionner
it: Seleziona
ja: 選択
pt: Selecionar
th: เลือก
tr: Seç

source: Select All
ar: تحديد الكل
de: Alle auswählen
es: Seleccionar todo
fr: Tout sélectionner
it: Seleziona tutto
ja: すべて選択
pt: Selecionar tudo
th: เลือกทั้งหมด
tr: Tümünü Seç

source: Current name
ar: الاسم الحالي
de: Aktueller Dateiname
es: Nombre actual
fr: Nom actuel
it: Nome attuale
ja: 現在のファイル名
pt: Nome atual
th: ชื่อไฟล์ปัจจุบัน
tr: Mevcut Dosya Adı

source: New name
ar: الاسم الجديد
de: Neuer Dateiname
es: Nuevo nombre
fr: Nouveau nom
it: Nuovo nome
ja: 新しいファイル名
pt: Novo nome
th: ชื่อใหม่
tr: Yeni Dosya Adı

source: Files
ar: الملفات
de: Dateien
es: Archivos
fr: Fichiers
it: File
ja: ファイル
pt: Arquivos
th: ไฟล์
tr: Dosyalar

source: Directories
ar: الدلائل
de: Verzeichnisse
es: Directorios
fr: Répertoires
it: Directory
ja: ディレクトリ
pt: Diretórios
th: โฟลเดอร์
tr: Klasörler

source: Files & Dirs
ar: الملفات والدلائل
de: Dateien und Verzeichnisse
es: Archivos y directorios
fr: Fichiers & Répertoires
it: File e Directory
ja: ファイルとディレクトリ
pt: Arquivos e diretórios
th: ไฟล์และโฟลเดอร์
tr: Dosyalar ve Klasörler

source: Filter
ar: تصفية
es: Filtrar
fr: Filtrer
it: Filtra
ja: フィルター
pt: Filtrar
th: กรอง
tr: Filtrele

source: Add file
ar: إضافة ملف
de: Datei hinzufügen
es: Agregar archivo
fr: Ajouter un fichier
it: Aggiungi file
ja: ファイルを追加
pt: Adicionar arquivo
th: เพิ่มไฟล์
tr: Dosya Ekle

source: Add files
ar: الرجاء إضافة ملفات.
de: Bitte fügen Sie Dateien hinzu.
es: Por favor, agrega archivos.
fr: Veuillez ajouter des fichiers.
it: Si prega di aggiungere dei file.
ja: ファイルを追加してください。
pt: Por favor, adicione arquivos.
th: โปรดเพิ่มไฟล์
tr: Lütfen dosyalar ekleyin.

# dragToAdd
source: Drag and drop to add files.
ar: اسحب وأسقط الملفات للإضافة.
de: Ziehen Sie Dateien hierhin, um sie hinzuzufügen.
es: Arrastra y suelta archivos para agregarlos.
fr: Glissez et déposez des fichiers pour les ajouter.
it: Trascina i file per aggiungerli.
ja: 追加するためにファイルをドラッグ＆ドロップしてください。
pt: Arraste e solte arquivos para adicionar.
th: ลากและวางไฟล์เพื่อเพิ่ม
tr: Eklemek için dosyaları sürükleyin.

# dropToAdd
source: Drop to add files.
ar: أفلت الملفات هنا للإضافة.
de: Legen Sie Dateien hier ab, um sie hinzuzufügen.
es: Suelta archivos aquí para agregarlos.
fr: Déposez des fichiers ici.
it: Rilascia i file qui per aggiungerli.
ja: ここにファイルをドロップして追加してください。
pt: Solte os arquivos aqui para adicionar.
th: วางไฟล์ที่นี่เพื่อเพิ่ม
tr: Dosyaları buraya bırakın.

# fileAlreadyExists
source: Filename already used by another file
ar: اسم الملف موجود بالفعل
de: Dateiname wird bereits verwendet
es: El nombre de archivo ya está en uso
fr: Le nom de fichier est déjà utilisé
it: Il nome del file è già in uso
ja: ファイル名がすでに存在します
pt: O nome do arquivo já está em uso
th: ชื่อไฟล์ถูกใช้แล้ว
tr: Dosya Adı Zaten Kullanımda

source: Rename failed
ar: فشلت عملية إعادة التسمية
de: Umbenennen fehlgeschlagen
es: Error al renombrar
fr: Échec du renommage
it: Rinomina non riuscita
ja: リネームに失敗しました
pt: Falha ao renomear
th: เปลี่ยนชื่อล้มเหลว
tr: Yeniden Adlandırma Başarısız Oldu

# rulesSequentially
source: Rules are executed sequentially. Hold the '=' button on the left and drag it to sort rules.
ar: تُنفَّذ القواعد بترتيب، اسحب واسحب على زر '=' في الجانب الأيسر وقم بسحب لترتيب القواعد.
de: Regeln werden nacheinander ausgeführt. Klicken Sie auf eine Regel, um sie zu bearbeiten. Halten Sie die '='-Taste auf der linken Seite gedrückt und ziehen Sie sie, um die Regeln zu sortieren.
es: Las reglas se ejecutan secuencialmente. Haga clic en una regla para editarla. Mantenga presionado el botón '=' a la izquierda y arrástrelo para ordenar las reglas.
fr: Les règles sont exécutées séquentiellement. Maintenez le bouton '=' à gauche d'une règle et faites glisser pour les réorganiser.
it: Le regole vengono eseguite sequenzialmente. Fare clic su una regola per modificarla. Tenere premuto il pulsante '=' a sinistra e trascinarlo per ordinare le regole.
ja: ルールは順次実行されます。ルールを編集するにはクリックします。左側の「=」ボタンを押しながらドラッグしてルールを並べ替えることができます。
pt: As regras são executadas sequencialmente. Segure o botão '=' à esquerda de uma regra e arraste para reordenar.
th: กฏถูกดำเนินการต่อเนื่องกัน. คลิกที่กฏเพื่อแก้ไข. กดปุ่ม '=' ทางซ้ายและลากเพื่อเรียงลำดับกฏ.
tr: Kurallar sırayla uygulanır. Bir kuralı düzenlemek için tıklayın. Kuralları sıralamak için sol taraftaki '=' düğmesini basılı tutun ve sürükleyin.

# noSysDir
source: Do not rename a system reserved directory.
ar: يرجى عدم إعادة تسمية الدلائل المحجوزة للنظام.
de: Reservierte Systemverzeichnisse nicht umbenennen.
es: No renombres directorios reservados del sistema.
fr: Ne pas renommer les répertoires système réservés.
it: Non rinominare le directory di sistema riservate.
ja: システム予約ディレクトリはリネームしないでください。
pt: Não renomeie diretórios protegidos pelo sistema.
th: อย่าเปลี่ยนชื่อโฟลเดอร์ที่ระบบสงวนไว้
tr: Lütfen sistem korumalı klasörleri yeniden adlandırmayın.

# fileSortName
source: Name
ar: الاسم
es: Nombre
fr: Nom
it: Nome
ja: 名前
pt: Nome
th: ชื่อ
tr: Ad

# fileSortSize
source: Size
ar: الحجم
de: Größe
es: Tamaño
fr: Taille
it: Dimensione
ja: サイズ
pt: Tamanho
th: ขนาด
tr: Boyut

# fileSortDate
source: Date
ar: التاريخ
de: Datum
es: Fecha
it: Data
ja: 日付
pt: Data
th: วันที่
tr: Tarih

# fileSortType
source: Type
ar: النوع
de: Typ
es: Tipo
it: Tipo
ja: タイプ
pt: Tipo
th: ประเภท
tr: Tür

# transliterateUpper
source: Latin characters to upper case
ar: تحويل إلى أحرف لاتينية كبيرة
de: In Lateinische Großbuchstaben umwandeln
es: Transliterar a caracteres latinos en mayúsculas
fr: Convertir en majuscules latines
it: Traslittera in maiuscolo caratteri latini
ja: 大文字のラテン文字に変換
pt: Transliterar para caracteres latinos maiúsculos
th: แปลงเป็นอักษรละตินตัวใหญ่
tr: Büyük Latin Harfine Dönüştür

# transliterateLower
source: Latin characters to lower case
ar: تحويل إلى أحرف لاتينية صغيرة
de: In Lateinische Kleinbuchstaben umwandeln
es: Transliterar a caracteres latinos en minúsculas
fr: Convertir en minuscules latines
it: Traslittera in minuscolo caratteri latini
ja: 小文字のラテン文字に変換
pt: Transliterar para caracteres latinos minúsculos
th: แปลงเป็นอักษรละตินตัวเล็ก
tr: Küçük Latin Harfine Dönüştür

# transliterateTraditional
source: Chinese characters to traditional Chinese
ar: تحويل إلى الصيغة الصينية التقليدية
de: In traditionelles Chinesisch umwandeln
es: Transliterar a chino tradicional
fr: Convertir en chinois traditionnel
it: Traslittera in cinese tradizionale
ja: 繁体字に変換
pt: Transliterar para chinês tradicional
th: แปลงเป็นอักษรจีนตัวดั้งเดิม
tr: Geleneksel Çince'ye Dönüştür

# transliterateSimplified
source: Chinese characters to simplified Chinese
ar: تحويل إلى الصيغة الصينية المبسطة
de: In vereinfachtes Chinesisch umwandeln
es: Transliterar a chino simplificado
fr: Convertir en chinois simplifié
it: Traslittera in cinese semplificato
ja: 簡体字に変換
pt: Transliterar para chinês simplificado
th: แปลงเป็นอักษรจีนตัวย่อ
tr: Basitleştirilmiş Çince'ye Dönüştür

# transliteratePinyin
source: Chinese characters to pinyin
ar: تحويل النص الصيني إلى البينين
de: Chinesisch in Pinyin umwandeln
es: Transliterar chino a pinyin
fr: Transcrire le chinois en pinyin
it: Traslittera il cinese in Pinyin
ja: 中国語をピンインに変換
pt: Transliterar chinês para pinyin
th: แปลงอักษรจีนเป็นพินอิน
tr: Çinceden Pinyin'e Dönüştür

# transliterateCyrillic2Latin
source: Cyrillic characters to Latin
ar: تحويل الحروف السيريلية إلى أحرف لاتينية
de: Von Kyrillisch in Lateinisch umwandeln
es: Transliterar de cirílico a caracteres latinos
fr: Convertir en caractères latins depuis le cyrillique
it: Traslittera caratteri cirillici in latini
ja: キリル文字をラテン文字に変換
pt: Transliterar caracteres cirílicos para latinos
th: แปลงจากอักษรซีริลลิกเป็นอักษรละติน
tr: Kiril'den Latin Harfine Dönüştür

# transliterateLatin2Cyrillic
source: Latin characters to Cyrillic
ar: تحويل الحروف اللاتينية إلى السيريلية
de: Von Lateinisch in Kyrillisch umwandeln
es: Transliterar de caracteres latinos a cirílico
fr: Convertir en caractères cyrilliques depuis le latin
it: Traslittera caratteri latini in cirillici
ja: ラテン文字をキリル文字に変換
pt: Transliterar caracteres latinos para cirílicos
th: แปลงจากอักษรละตินเป็นอักษรซีริลลิก
tr: Latin Harfinden Kiril'e Dönüştür

# insertTagInsideAnother
source: Do not insert a tag inside another tag.
ar: يرجى عدم إدراج علامة داخل علامة أخرى.
de: Kein Einsetzen einer Markierung in eine andere.
es: No insertes una etiqueta dentro de otra.
fr: Ne pas insérer une balise à l'intérieur d'une autre.
it: Non inserire un tag all'interno di un altro.
ja: 他のタグ内にタグを挿入しないでください。
pt: Não insira uma tag dentro de outra.
th: อย่าแทรกแท็กในแท็กอื่น
tr: Lütfen bir etiketin içine başka bir etiket eklemeyin.

# appError
source: Application error
ar: خطأ في التطبيق
de: App-Fehler
es: Error de la aplicación
fr: Erreur de l'application
it: Errore dell'applicazione
ja: アプリケーションエラー
pt: Erro do aplicativo
th: ข้อผิดพลาดของแอป
tr: Uygulama Hatası

source: Error details
ar: تفاصيل الخطأ
de: Fehlerdetails
es: Detalles del error
fr: Détails de l'erreur
it: Dettagli dell'errore
ja: エラーの詳細
pt: Detalhes do erro
th: รายละเอียดข้อผิดพลาด
tr: Hata Detayları

# ifFileNotShown
source: If files does not shown in file list, please clear all and continue.
ar: إذا لم يتم عرض الملفات في القائمة، يرجى مسح كل المحتوى والمحاولة مرة أخرى.
de: Wenn keine Dateien in der Liste angezeigt werden, löschen Sie bitte alles und fahren Sie fort.
es: Si los archivos no se muestran en la lista, borra todo y continua.
fr: Si aucun fichier n'apparaît dans la liste, veuillez tout effacer et recommencer.
it: Se i file non vengono mostrati nell'elenco, cancella tutto e continua.
ja: ファイルがリストに表示されない場合は、すべてクリアして続行してください。
pt: Se os arquivos não estiverem listados, limpe tudo e continue.
th: หากไม่มีไฟล์แสดงในรายการโปรดล้างข้อมูลทั้งหมดและลองอีกครั้ง
tr: Dosya listesinde dosyalar görüntülenmiyorsa, tüm içeriği temizleyin ve devam edin.

source: Metadata tags
ar: علامات البيانات الوصفية
de: Metadaten-Tags
es: Etiquetas de metadatos
fr: Balises de métadonnées
it: Tag dei metadati
ja: メタデータタグ
pt: Tags de metadados
th: แท็กข้อมูลเมตา
tr: Meta Veri Etiketleri

# osTodayDate
source: Date of today
ar: تاريخ اليوم
de: Aktuelles Datum
es: Fecha actual
fr: Date actuelle
it: Data odierna
ja: 今日の日付
pt: Data atual
th: วันที่ปัจจุบัน
tr: Bugünün Tarihi

# osNowTime
source: Time of now
ar: الوقت الحالي
de: Aktuelle Uhrzeit
es: Hora actual
fr: Heure actuelle
it: Orario attuale
ja: 現在の時刻
pt: Hora atual
th: เวลาปัจจุบัน
tr: Şu Anki Zaman

# fileSize
source: Size of file
ar: حجم الملف
de: Dateigröße
es: Tamaño del archivo
fr: Taille du fichier
it: Dimensione file
ja: ファイルサイズ
pt: Tamanho do arquivo
th: ขนาดไฟล์
tr: Dosya Boyutu

# fileCreateDate
source: Create date of file
ar: تاريخ إنشاء الملف
de: Dateierstellungsdatum
es: Fecha de creación del archivo
fr: Date de création du fichier
it: Data creazione file
ja: ファイル作成日
pt: Data de criação do arquivo
th: วันที่สร้างไฟล์
tr: Dosya Oluşturma Tarihi

# fileCreateTime
source: Create time of file
ar: وقت إنشاء الملف
de: Dateierstellungszeit
es: Hora de creación del archivo
fr: Heure de création du fichier
it: Ora creazione file
ja: ファイル作成時間
pt: Hora de criação do arquivo
th: เวลาสร้างไฟล์
tr: Dosya Oluşturma Saati

# fileModifyDate
source: Modify date of file
ar: تاريخ تعديل الملف
de: Dateiänderungsdatum
es: Fecha de modificación del archivo
fr: Date de modification du fichier
it: Data modifica file
ja: ファイル変更日
pt: Data de modificação do arquivo
th: วันที่แก้ไขไฟล์
tr: Dosya Değiştirme Tarihi

# fileModifyTime
source: Modify time of file
ar: وقت تعديل الملف
de: Dateiänderungszeit
es: Hora de modificación del archivo
fr: Heure de modification du fichier
it: Ora modifica file
ja: ファイル変更時間
pt: Hora de modificação do arquivo
th: เวลาแก้ไขไฟล์
tr: Dosya Değiştirme Saati

# photoDate
source: Photographing date from exif
ar: تاريخ التقاط الصورة (من exif)
de: Aufnahmedatum des Fotos (EXIF)
es: Fecha de captura de la foto (EXIF)
fr: Date de prise de vue de la photo (EXIF)
it: Data scatto foto (da EXIF)
ja: 写真撮影日（Exifから）
pt: Data de captura da foto (do EXIF)
th: วันที่ถ่ายภาพ (จาก exif)
tr: Fotoğraf Çekim Tarihi (EXIF'ten)

# photoTime
source: Photographing time from exif
ar: وقت التقاط الصورة (من exif)
de: Aufnahmezeit des Fotos (EXIF)
es: Hora de captura de la foto (EXIF)
fr: Heure de prise de vue de la photo (EXIF)
it: Orario scatto foto (da EXIF)
ja: 写真撮影時間（Exifから）
pt: Hora de captura da foto (do EXIF)
th: เวลาถ่ายภาพ (จาก exif)
tr: Fotoğraf Çekim Saati (EXIF'ten)

# photoCamName
source: Camera name from exif
ar: اسم الكاميرا (من exif)
de: Kameraname (EXIF)
es: Nombre de la cámara (EXIF)
fr: Nom de l'appareil photo (EXIF)
it: Nome fotocamera (da EXIF)
ja: カメラ名（Exifから）
pt: Nome da câmera (do EXIF)
th: ชื่อกล้อง (จาก exif)
tr: Kamera Adı (EXIF'ten)

# photoLensName
source: Lens name from exif
ar: اسم العدسة (من exif)
de: Objektivname (EXIF)
es: Nombre del objetivo (EXIF)
fr: Nom de l'objectif (EXIF)
it: Nome obiettivo (da EXIF)
ja: レンズ名（Exifから）
pt: Nome da lente (do EXIF)
th: ชื่อเลนส์ (จาก exif)
tr: Lens Adı (EXIF'ten)

# photoFocalLength
source: Focal length from exif
ar: البعد البؤري (من exif)
de: Brennweite (EXIF)
es: Longitud focal (EXIF)
fr: Longueur focale (EXIF)
it: Lunghezza focale (da EXIF)
ja: 焦点距離（Exifから）
pt: Distância focal (do EXIF)
th: ระยะโฟกัส (จาก exif)
tr: Odak Uzunluğu (EXIF'ten)

# photoAperture
source: Aperture value from exif
ar: قيمة الفتحة (من exif)
de: Blendenöffnungswert (EXIF)
es: Apertura (EXIF)
fr: Ouverture (EXIF)
it: Diaframma (da EXIF)
ja: 絞り値（Exifから）
pt: Valor do diafragma (do EXIF)
th: ค่ารูรับแสง (จาก exif)
tr: Diyafram Değeri (EXIF'ten)

# photoShutter
source: Shutter speed from exif
ar: سرعة الغالق (من exif)
de: Verschlussgeschwindigkeit (EXIF)
es: Velocidad de obturación (EXIF)
fr: Vitesse d'obturation (EXIF)
it: Velocità dell'otturatore (da EXIF)
ja: シャッタースピード（Exifから）
pt: Velocidade do obturador (do EXIF)
th: ความเร็วชัตเตอร์ (จาก exif)
tr: Enstantane Hızı (EXIF'ten)

# photoISO
source: ISO value from exif
ar: قيمة ISO (من exif)
de: ISO-Wert (EXIF)
es: ISO (EXIF)
fr: Sensibilité ISO (EXIF)
it: Valore ISO (da EXIF)
ja: ISO値（Exifから）
pt: Valor ISO (do EXIF)
th: ค่า ISO (จาก exif)
tr: ISO Değeri (EXIF'ten)

# photoLongitude
source: Longitude of photo GPS from exif
ar: خط الطول للصورة (من exif)
de: Längengrad des Fotos (EXIF)
es: Longitud GPS de la foto (EXIF)
fr: Longitude GPS de la photo (EXIF)
it: Longitudine GPS della foto (da EXIF)
ja: 写真のGPS経度（Exifから）
pt: Longitude GPS da foto (do EXIF)
th: ลองจิจูดของรูปภาพ (จาก exif)
tr: Fotoğraf GPS Boylamı (EXIF'ten)

# photoLatitude
source: Latitude of photo GPS from exif
ar: خط العرض للصورة (من exif)
de: Breitengrad des Fotos (EXIF)
es: Latitud GPS de la foto (EXIF)
fr: Latitude GPS de la photo (EXIF)
it: Latitudine GPS della foto (da EXIF)
ja: 写真のGPS緯度（Exifから）
pt: Latitude GPS da foto (do EXIF)
th: ละติจูดของรูปภาพ (จาก exif)
tr: Fotoğraf GPS Enlemi (EXIF'ten)

# photoAltitude
source: Altitude of photo GPS from exif
ar: الارتفاع للصورة (من exif)
de: Höhe des Fotos (EXIF)
es: Altitud GPS de la foto (EXIF)
fr: Altitude GPS de la photo (EXIF)
it: Altitudine GPS della foto (da EXIF)
ja: 写真のGPS高度（Exifから）
pt: Altitude GPS da foto (do EXIF)
th: ความสูงจากระดับน้ำทะเลของรูปภาพ (จาก exif)
tr: Fotoğraf GPS Yüksekliği (EXIF'ten)

# photoPhotographer
source: Photographer name from exif
ar: اسم المصور (من exif)
de: Name des Fotografen (EXIF)
es: Nombre del fotógrafo (EXIF)
fr: Nom du photographe (EXIF)
it: Nome del fotografo (da EXIF)
ja: 写真家の名前（Exifから）
pt: Nome do fotógrafo (do EXIF)
th: ชื่อช่างภาพ (จาก exif)
tr: Fotoğrafçı Adı (EXIF'ten)

# photoCopyright
source: Copyright holder name from exif
ar: اسم مالك الحقوق (من exif)
de: Name des Urheberrechtsinhabers (EXIF)
es: Nombre del propietario de los derechos de autor (EXIF)
fr: Nom du propriétaire des droits d'auteur (EXIF)
it: Nome del proprietario del copyright (da EXIF)
ja: 著作権者の名前（Exifから）
pt: Nome do detentor dos direitos autorais (do EXIF)
th: ชื่อเจ้าของลิขสิทธิ์ (จาก exif)
tr: Telif Hakkı Sahibi Adı (EXIF'ten)

# musicAlbumName
source: Name of the album
ar: اسم الألبوم
de: Albumname
es: Nombre del álbum
fr: Nom de l'album
it: Nome dell'album
ja: アルバム名
pt: Nome do álbum
th: ชื่ออัลบั้ม
tr: Albüm Adı

# musicAlbumArtist
source: Name of the album artist
ar: اسم فنان الألبوم
de: Albumkünstler
es: Nombre del artista del álbum
fr: Artiste de l'album
it: Artista dell'album
ja: アルバムアーティスト名
pt: Nome do artista do álbum
th: ชื่อศิลปินอัลบั้ม
tr: Albüm Sanatçısı

# musicAlbumLength
source: Number of tracks in the album
ar: عدد الأغاني في الألبوم
de: Anzahl der Titel im Album
es: Cantidad de canciones en el álbum
fr: Nombre de pistes dans l'album
it: Numero di tracce nell'album
ja: アルバム内の曲数
pt: Número de faixas no álbum
th: จำนวนเพลงในอัลบั้ม
tr: Albümdeki Şarkı Sayısı

# musicYear
source: Publishing year of the track
ar: سنة الإصدار
de: Veröffentlichungsjahr des Titels
es: Año de publicación
fr: Année de publication de la piste
it: Anno di pubblicazione
ja: 曲の発売年
pt: Ano de lançamento da faixa
th: ปีที่เพลงออก
tr: Şarkının Yayın Yılı

# musicTrackDuration
source: Duration of the track
ar: مدة الأغنية
de: Dauer des Titels
es: Duración de la canción
fr: Durée de la piste
it: Durata della traccia
ja: 曲の再生時間
pt: Duração da faixa
th: ระยะเวลาเพลง
tr: Şarkı Süresi

# musicTrackName
source: Name of the track
ar: اسم الأغنية
de: Name des Titels
es: Nombre de la canción
fr: Nom de la piste
it: Nome della traccia
ja: 曲名
pt: Nome da faixa
th: ชื่อเพลง
tr: Şarkı Adı

# musicTrackArtist
source: Names of the artists performing in the track
ar: اسم فنان الأغنية
de: Künstler des Titels
es: Nombre del artista de la canción
fr: Artiste interprète de la piste
it: Artista della traccia
ja: 曲のアーティスト名
pt: Nome do artista da faixa
th: ศิลปินเพลง
tr: Şarkıcı

# musicTrackNumber
source: Position of track in the album
ar: موقع الأغنية في الألبوم
de: Position des Titels im Album
es: Número de la canción en el álbum
fr: Numéro de piste dans l'album
it: Numero della traccia nell'album
ja: 曲のトラック番号
pt: Número da faixa no álbum
th: ลำดับของเพลงในอัลบั้ม
tr: Şarkı Numarası

# musicDiscNumber
source: Position of disc
ar: موقع القرص
de: Position der Disc
es: Número del disco
fr: Numéro du disque
it: Numero del disco
ja: ディスク番号
pt: Número do disco
th: ลำดับของดิสก์
tr: Disk Numarası

# musicGenres
source: Art type of the music
ar: الأنواع الموسيقية
de: Genre des Titels
es: Géneros de la canción
fr: Genres musicaux
it: Generi della traccia
ja: 曲のジャンル
pt: Gêneros da faixa
th: แนวเพลง
tr: Müzik Türleri

# musicAuthor
source: Author of the track
ar: مؤلف الأغنية
de: Autor des Titels
es: Autor de la canción
fr: Auteur de la piste
it: Autore della traccia
ja: 曲の作者
pt: Autor da faixa
th: ผู้เขียนเพลง
tr: Yazar

# musicWriter
source: Writer of the track
ar: كاتب الأغنية
de: Verfasser des Titels
es: Escritor de la canción
fr: Compositeur de la piste
it: Scrittore della traccia
ja: 曲の作詞者
pt: Escritor da faixa
th: ผู้แต่งเนื้อเพลง
tr: Yazar

source: Prefix
ar: بادئة
de: Präfix
es: Prefijo
fr: Préfixe
it: Prefisso
ja: 接頭辞
pt: Prefixo
th: คำนำหน้า
tr: Ön Ek

source: Start index
ar: الفهرس البدئي
es: Índice inicial
fr: Index de départ
it: Indice di partenza
ja: 開始インデックス
pt: Índice inicial
th: ดัชนีเริ่มต้น
tr: Başlangıç İndeksi

source: Index incremental step
ar: الزيادة في الفهرس
de: Inkrementalschritt
es: Incremento de índice
fr: Pas d'incrémentation d'index
it: Passo incrementale dell'indice
ja: インデックスの増分ステップ
pt: Incremento do índice
th: ขั้นตอนการเพิ่มดัชนี
tr: İndeks Artış Adımı

source: Omit dash
ar: تجاهل الشرطة
de: Bindestrich auslassen
es: Omitir guión
fr: Omettre le tiret
it: Ometti il trattino
ja: ダッシュを省略
pt: Omitir hífen
th: ละเว้นขีด
tr: Tireyi Atla

source: Ignore Extension
ar: تجاهل الامتداد
de: Dateierweiterung ignorieren
es: Ignorar extensión
fr: Ignorer l'extension
it: Ignora l'estensione
ja: 拡張子を無視
pt: Ignorar extensão
th: ละเว้นนามสกุล
tr: Uzantıyı Yoksay

# insertedText
source: Text to be inserted
ar: النص المُدخَل
de: Einzufügender Text
es: Texto insertado
fr: Texte à insérer
it: Testo inserito
ja: 挿入するテキスト
pt: Texto a ser inserido
th: ข้อความที่แทรก
tr: Eklenecek Metin

source: Insert index
ar: فهرس الإدراج
de: Einzufügender Index
es: Índice de inserción
fr: Index d'insertion
it: Indice di inserimento
ja: 挿入位置
pt: Índice de inserção
th: แทรกดัชนี
tr: Ekleme İndeksi

source: From start
ar: من البداية
de: Von Anfang an zählen
es: Desde el inicio
fr: À partir du début
it: Dall'inizio
ja: 先頭から
pt: Do início
th: จากจุดเริ่มต้น
tr: Baştan Başla

source: Insert before index
ar: قبل فهرس الإدراج
de: Vor dem Index einfügen
es: Insertar antes del índice
fr: Insérer avant l'index
it: Inserisci prima dell'indice
ja: 指定位置の前に挿入
pt: Inserir antes do índice
th: แทรกก่อนดัชนี
tr: İndeks Öncesine Ekle

source: Rearrange delimiter
ar: الفاصل
de: Trennzeichen
es: Delimitador
fr: Délimiteur
it: Delimitatore
ja: 区切り文字
pt: Delimitador
th: ตัวคั่นในการจัดเรียงใหม่
tr: Ayraç

# rearrangeOrderLabel
source: Rearrange order
ar: ترتيب الإعادة الترتيب
de: Reihenfolge neu anordnen
es: Orden de reorganización
fr: Ordre de réorganisation
it: Ordine del riordinamento
ja: 並べ替え順序
pt: Ordem de rearranjo
th: ลำดับการจัดเรียงใหม่
tr: Yeniden Sıralama Sırası

# rearrangeOrderHint
source: numbers separated with comma
ar: الرجاء إدخال الأرقام المقابلة، مفصولة بفاصلة إنجليزية
de: Bitte geben Sie die entsprechenden Zahlen ein, durch Kommas getrennt
es: Ingrese los números correspondientes, separados por comas
fr: Entrez les chiffres correspondants, séparés par des virgules
it: Inserisci i numeri corrispondenti separati da virgole
ja: 該当する数字を入力し、カンマで区切ってください
pt: Insira os números correspondentes, separados por vírgula
th: โปรดป้อนตัวเลขที่เกี่ยวข้องโดยใช้เครื่องหมายจุลภาคในการแยก
tr: Sıralamak için ilgili sayıları virgülle ayırarak girin

source: target
ar: الهدف
de: Ziel
es: Objetivo
fr: Cible
it: Obiettivo
ja: ターゲット
pt: Alvo
th: เป้าหมาย
tr: Hedef

source: Replacement
ar: البديل
de: Ersetzung
es: Reemplazo
fr: Remplacement
it: Sostituzione
ja: 置換文字
pt: Substituição
th: การแทนที่ด้วย
tr: Değiştirme

source: limit
ar: الحد
es: Límite
fr: Limite
it: Limite
ja: 回数制限
pt: Limite
th: จำกัด
tr: Sınır

source: Case sensitive
ar: حساسية لحالة الأحرف
de: Groß-/Kleinschreibung beachten
es: Sensible a mayúsculas
fr: Sensible à la casse
it: Maiuscole/minuscole
ja: 大文字と小文字を区別する
pt: Diferenciar maiúsculas de minúsculas
th: ตรวจสอบตัวพิมพ์ใหญ่เล็ก
tr: Büyük Küçük Harfe Duyarlı
