Repository: sun-jiao/flut-renamer
Catalog: lib/arb/intl_*.arb
Languages: ar, de, es, fr, it, ja, pt, th, tr

source: Is regex
ar: استخدام التعبيرات المنطقية
de: Regulären Ausdruck verwenden
es: Usar expresión regular
fr: Utiliser les expressions régulières
it: Usa espressione regolare
ja: 正規表現を使用
pt: Usar expressão regular
th: ใช้เป็น Regular Expression
tr: Düzenli İfade Kullan

source: Language:
ar: اللغة:
de: Sprache:
es: Idioma:
fr: Langue :
it: Lingua:
ja: 言語：
pt: Idioma:
th: ภาษา:
tr: Dil:

# indexOne
source: First character index
ar: الموقع الأول
de: Erste Stelle
es: Primera posición
fr: Première position
it: Posizione uno
ja: 位置1
pt: Primeira posição
th: ตำแหน่งแรก
tr: Birinci Konum

# indexTwo
source: Second character index
ar: الموقع الثاني
de: Zweite Stelle
es: Segunda posición
fr: Deuxième position
it: Posizione due
ja: 位置2
pt: Segunda posição
th: ตำแหน่งที่สอง
tr: İkinci Konum

source: -to-last
ar: إلى الأخير
de: Letzte Stelle
es: Hasta el final
fr: À la dernière
it: Alla fine
ja: 最後まで
pt: Para o último
th: สุดท้าย
tr: Son'a Kadar

source: Going forward
ar: الانتقال للأمام
de: Vorwärts
es: Avanzar
fr: Avancer
it: Avanti
ja: 前進中
pt: Indo para frente
th: ไปข้างหน้า
tr: İleri Gitme

# keepCharacters
source: Keep characters between them
ar: الاحتفاظ بالأحرف بينهما
de: Zeichen zwischen beiden behalten
es: Mantener caracteres entre ambos
fr: Conserver les caractères entre les deux positions
it: Mantieni i caratteri tra i due
ja: 両方の文字を保持
pt: Manter caracteres entre os dois
th: เก็บอักขระทั้งสองข้าง
tr: İki Konum Arasındaki Karakterleri Tut

# removeCharacters
source: Remove characters between them
ar: إزالة الأحرف بينهما
de: Zeichen zwischen beiden entfernen
es: Eliminar caracteres entre ambos
fr: Supprimer les caractères entre les deux positions
it: Rimuovi i caratteri tra i due
ja: 両方の文字を削除
pt: Remover caracteres entre os dois
th: ลบอักขระที่อยู่ระหว่าง
tr: İki Konum Arasındaki Karakterleri Kaldır

# metadataParserNotProvided
source: Contains metadata tag while MetadataParser was not provided.
ar: يحتوي على علامات البيانات الوصفية، لكن لم يتم توفير محلل البيانات الوصفية.
de: Metadatentags vorhanden, aber kein Metadatenparser bereitgestellt.
es: Se incluyen etiquetas de metadatos pero no se proporciona un analizador de metadatos.
fr: Les balises de métadonnées sont incluses, mais aucun analyseur de métadonnées n'a été fourni.
it: Tag dei metadati presenti ma non è stato fornito alcun analizzatore di metadati.
ja: メタデータタグが含まれていますが、メタデータパーサーが提供されていません。
pt: Tags de metadados estão presentes, mas nenhum analisador de metadados foi fornecido.
th: มีแท็กข้อมูลแต่ไม่มีตัวแยก ไม่สามารถแยกและดึงข้อมูลได้
tr: Meta veri etiketleri içeriyor ancak meta veri ayrıştırıcısı sağlanmadı.

# replaceToString
source: Replace "{targetString}" with "{replacementString}".
ar: استبدال: استبدال "{targetString}" بـ "{replacementString}".
de: Ersetzen: "{targetString}" durch "{replacementString}" ersetzen.
es: Reemplazar "{targetString}" con "{replacementString}".
fr: Remplacement : Remplacer "{targetString}" par "{replacementString}".
it: Sostituisce "{targetString}" con "{replacementString}".
ja: 置換：「{targetString}」を「{replacementString}」に置換します。
pt: Substituir: substituir "{targetString}" por "{replacementString}".
th: แทนที่: แทนที่ "{targetString}" ด้วย "{replacementString}"
tr: Değiştir: "{targetString}" hedef metni "{replacementString}" ile değiştirin.

# removeToString
source: Remove "{targetString}"
ar: إزالة: "{targetString}"
de: Entfernen: "{targetString}"
es: Eliminar "{targetString}"
fr: Suppression : "{targetString}"
it: Rimuove "{targetString}".
ja: 削除：「{targetString}」
pt: Remover: "{targetString}"
th: ลบ: "{targetString}"
tr: Kaldır: "{targetString}"

# insertToString
source: Insert "{insert}" at the {insertIndex}{ordinal, select, o1{st} o2{nd} o3{rd} other{th}}{toEnd, select, true{-to-end} false{} other{}} character.
ar: إدراج: إدراج "{insert}" في الموقع {toEnd, select, true{الآخير} false{الأول} other{}} بموقع الإدراج {insertIndex}.
de: Einfügen: "{insert}" an Position {insertIndex}{toEnd, select, true{ von hinten} other{}}.
es: Insertar "{insert}" en la posición {toEnd, select, true{final} false{inicial} other{}} en el índice {insertIndex}.
fr: Insertion : Insérer "{insert}" à la position {insertIndex}, {toEnd, select, true{en partant de la fin} false{} other{à partir du début}}.
it: Inserisce "{insert}" all'indice {insertIndex}{toEnd, select, true{dalla fine} false{} other{}}.
ja: 挿入：{toEnd, select, true{末尾から} false{} other{}}第{insertIndex}文字に「{insert}」を挿入します。
pt: Inserir: inserir "{insert}" na {toEnd, select, true{última} false{} other{}} posição {insertIndex}.
th: แทรก: แทรก "{insert}" ที่ตำแหน่งที่ {toEnd, select, true{สุดท้าย} false{} other{}} {insertIndex}
tr: Ekle: "{insert}" metnini {toEnd, select, true{son} false{}} {insertIndex}. konuma ekleyin.

# incrementToString
source: Incremental renaming: {prefix}-index
ar: زيادة: {prefix}-الفهرس
de: Inkrementieren: {prefix}-Index
es: Incrementar con "{prefix}" e índice
fr: Incrémentation : {prefix} - Index
it: Incrementa con prefisso- indice
ja: 増分：{prefix}-インデックス
pt: Incrementar: {prefix} - índice
th: เพิ่ม: {prefix}-เลขดัชนี
tr: Artır: {prefix} - İndeks

# rearrangeToString
source: Rearrange: delimiter: {delimiter}, order: {order}.
ar: إعادة ترتيب: الفاصل: {delimiter}، الترتيب: {order}.
de: Neu anordnen: Trennzeichen: {delimiter}, Reihenfolge: {order}.
es: Reorganizar con delimitador "{delimiter}" y orden "{order}".
fr: Réorganisation : Délimiteur : {delimiter}, Ordre : {order}.
it: Riordina usando il delimitatore: {delimiter} e l'ordine: {order}.
ja: 並べ替え：区切り文字：{delimiter}、順序：{order}。
pt: Rearranjar: delimitador: {delimiter}, ordem: {order}.
th: จัดเรียงใหม่: ตัวคั่น: "{delimiter}", ลำดับ: {order}
tr: Yeniden Sırala: Ayraç: {delimiter}, Sıra: {order}.

# transliterateToString
source: Transliterate: convert {type}.
ar: تحويل الحروف: {type}.
de: Transliteration: {type}.
es: Transliterar a "{type}".
fr: Translittération : {type}.
it: Traslittera: {type}.
ja: 転写：{type}。
pt: Transliterar: {type}.
th: การเปลี่ยนตัวอักษร: {type}
tr: Harf Değiştirme: {type}.

# transliterateToStringCyrillic
source: Transliterate: convert {langName} {type}.
ar: تحويل: {langName}{type}.
de: Transliteration: Von {langName} {type}.
es: Transliterar a "{type}" en {langName}.
fr: Translittération : De {langName} à {type}.
it: Traslittera in {langName} {type}.
ja: 転写：{type}：{langName}。
pt: Transliterar: de {langName} para {type}.
th: การเปลี่ยนตัวอักษร: แปลงจาก {langName} {type}
tr: Harf Değiştirme: {langName} {type}.

# truncateToString
source: Truncate: {keepType, select, true{keep only} false{remove} other{}} characters between the {iOne}{iTwoOrdinal, select, o1{st} o2{nd} o3{rd} other{th}}{iOneToEnd, select, true{-to-end} false{} other{}} character and the {iTwo}{iOneOrdinal, select, o1{st} o2{nd} o3{rd} other{th}}{iTwoToEnd, select, true{-to-end} false{} other{}}.
ar: اقتصاص: {keepType, select, true{الاحتفاظ} false{الإزالة} other{}} من {iOneToEnd, select, true{الآخر} false{الأول} other{}} الموقع {iOne} إلى {iTwoToEnd, select, true{الآخر} false{الأول} other{}} الموقع {iTwo}.
de: Kürzen: {keepType, select, true{Behalten nur} false{Entfernen} other{}} vom {iOneToEnd, select, true{Ende} other{Anfang}} bei {iOne} bis {iTwoToEnd, select, true{Ende} other{Anfang}} bei {iTwo}.
es: Truncar: {keepType, select, true{Mantener} false{Eliminar} other{}} entre los caracteres {iOne} y {iTwo}.
fr: Troncature : {keepType, select, true{Conserver uniquement} false{Supprimer} other{}} entre {iOneToEnd, select, true{la dernière} false{} other{la première}} position {iOne} et {iTwoToEnd, select, true{la dernière} false{} other{la deuxième}} position {iTwo}.
it: Tronca: {keepType, select, true{Mantieni solo} false{Rimuovi} other{}} contenuto tra la posizione {iOne} e {iTwo}{iTwoToEnd, select, true{dalla fine} false{} other{}}.
ja: 切り詰め：{keepType, select, true{保持する} false{削除する} other{}}{iOneToEnd, select, true{末尾から} false{} other{}}第{iOne}文字から{iTwoToEnd, select, true{末尾から} false{} other{}}第{iTwo}文字までの内容。
pt: Truncar: {keepType, select, true{manter apenas} false{remover} other{}} do {iOneToEnd, select, true{último} false{} other{}} {iOne}º ao {iTwoToEnd, select, true{último} false{} other{}} {iTwo}º caractere.
th: ตัด: {keepType, select, true{เก็บเฉพาะ} false{ลบ} other{}} ตั้งแต่ตำแหน่งที่ {iOneToEnd, select, true{สุดท้าย} false{} other{}} {iOne} ไปยังตำแหน่งที่ {iTwoToEnd, select, true{สุดท้าย} false{} other{}} {iTwo}
tr: Kırp: {keepType, select, true{yalnızca tut} false{kaldır} other{}} {iOneToEnd, select, true{sondan başlayarak} false{}} {iOne}. konumdan {iTwoToEnd, select, true{sondan başlayarak} false{}} {iTwo}. konuma kadar içeriği.

# descriptionReplace
source: Replace the specified text (or text matching the provided regular expression) with the given replacement text (or file metadata and EXIF data).
ar: استبدل النص المحدد (أو النص المتطابق مع التعبير العادي المقدم) بالنص المحدد (أو بيانات الملف وبيانات EXIF).
de: Ersetzen Sie den angegebenen Text (oder den Text, der dem bereitgestellten regulären Ausdruck entspricht) durch den angegebenen Ersatztext (oder Dateimetadaten und EXIF-Daten).
es: Reemplazar texto especificado (o coincidente con la expresión regular proporcionada) con el texto de reemplazo especificado (o datos de metadatos y EXIF).
fr: Remplacer le texte spécifié (ou le texte correspondant à l'expression régulière fournie) par le texte de remplacement donné (ou par les métadonnées du fichier et les données EXIF).
it: Sostituisce il testo specificato (o il testo corrispondente all'espressione regolare fornita) con il testo di sostituzione fornito (o i dati dei metadati del file ed EXIF).
ja: 指定されたテキスト（またはファイルメタデータおよびEXIFデータ）を指定されたテキスト（または提供された正規表現に一致するテキスト）で置換します。
pt: Substituir o texto especificado (ou texto correspondente a uma expressão regular fornecida) pelo texto de substituição fornecido (ou metadados de arquivo e dados EXIF).
th: แทนที่ข้อความที่ระบุ (หรือข้อมูลเมตาดาต้าและ EXIF) ด้วยข้อความที่ระบุ (หรือข้อมูลเมตาดาต้าและ EXIF) ที่กำหนด
tr: Belirtilen metni (veya verilen düzenli ifadeyle eşleşen metni) verilen değiştirme metni (veya dosya meta verisi ve EXIF verileriyle) ile değiştirin.

# descriptionRemove
source: Remove the specified text (or text matching the provided regular expression) from the filename.
ar: احذف النص المحدد (أو النص المتطابق مع التعبير العادي المقدم) من اسم الملف.
de: Entfernen Sie den angegebenen Text (oder den Text, der dem bereitgestellten regulären Ausdruck entspricht) aus dem Dateinamen.
es: Eliminar texto especificado (o coincidente con la expresión regular proporcionada) del nombre del archivo.
fr: Supprimer le texte spécifié (ou le texte correspondant à l'expression régulière fournie) du nom de fichier.
it: Rimuove il testo specificato (o il testo corrispondente all'espressione regolare fornita) dal nome del file.
ja: 指定されたテキスト（または提供された正規表現に一致するテキスト）をファイル名から削除します。
pt: Remover o texto especificado (ou texto correspondente a uma expressão regular fornecida) do nome do arquivo.
th: ลบข้อความที่ระบุ (หรือข้อมูลเมตาดาต้าและ EXIF) ออกจากชื่อไฟล์
tr: Belirtilen metni (veya verilen düzenli ifadeyle eşleşen metni) dosya adından kaldırın.

# descriptionInsert
source: Insert the specified text (or file metadata and EXIF data) at the designated position.
ar: أدرج النص المحدد (أو بيانات الملف وبيانات EXIF) في الموقع المحدد.
de: Fügen Sie den angegebenen Text (oder Dateimetadaten und EXIF-Daten) an der angegebenen Position in den Dateinamen ein.
es: Insertar texto especificado (o datos de metadatos y EXIF) en la posición especificada.
fr: Insérer le texte spécifié (ou les métadonnées du fichier et les données EXIF) à la position spécifiée dans le nom de fichier.
it: Inserisce il testo specificato (o i dati dei metadati del file ed EXIF) in una posizione specificata.
ja: 指定された位置に指定されたテキスト（またはファイルメタデータおよびEXIFデータ）を挿入します。
pt: Inserir o texto especificado (ou metadados de arquivo e dados EXIF) em uma posição específica.
th: แทรกข้อความที่ระบุ (หรือข้อมูลเมตาดาต้าและ EXIF) ที่ตำแหน่งที่ระบุ
tr: Belirtilen konuma belirtilen metni (veya dosya meta verisi ve EXIF verileriyle) ekleyin.

# descriptionIncrement
source: Increment the filename, e.g., Photo-1, Photo-2, Photo-3.
ar: زيادة في تسمية الملفات، على سبيل المثال: ملف-1، ملف-2، ملف-3.
de: Inkrementieren Sie den Dateinamen, z. B. Foto-1, Foto-2, Foto-3.
es: Incrementar el nombre del archivo, por ejemplo, Foto-1, Foto-2, Foto-3.
fr: Incrémenter le nom de fichier, par exemple, Photo-1, Photo-2, Photo-3.
it: Incrementa il nome del file, ad esempio Foto-1, Foto-2, Foto-3.
ja: ファイル名を増分します。例：写真-1、写真-2、写真-3。
pt: Incrementar o nome do arquivo, por exemplo, Foto-1, Foto-2, Foto-3.
th: เพิ่มเลขดัชนีในชื่อไฟล์ (เช่น รูปภาพ-1, รูปภาพ-2, รูปภาพ-3)
tr: Dosya adını artırın, örneğin Fotoğraf-1, Fotoğraf-2, Fotoğraf-3.

# descriptionRearrange
source: Splitting the filename by the user-specified delimiter and rearrange segments according to the provided order.
ar: قم بتقسيم اسم الملف إلى أجزاء باستخدام الفاصل المحدد وإعادة ترتيبها بترتيب محدد.
de: Teilen Sie den Dateinamen anhand des vom Benutzer angegebenen Trennzeichens in Segmente auf und ordnen Sie diese Segmente gemäß der bereitgestellten Reihenfolge neu an.
es: Dividir el nombre del archivo en segmentos utilizando el delimitador especificado y reorganizarlos según el orden proporcionado por el usuario.
fr: Diviser le nom de fichier en segments en fonction du délimiteur spécifié par l'utilisateur, puis réorganiser ces segments selon l'ordre fourni.
it: Separa il nome del file usando un delimitatore specificato dall'utente e lo riordina secondo l'ordine fornito.
ja: ファイル名を指定された区切り文字で分割し、提供された順序に従って並べ替えます。
pt: Dividir o nome do arquivo em segmentos usando um delimitador especificado pelo usuário e rearranjá-los na ordem especificada.
th: แยกชื่อไฟล์เป็นส่วนๆ ด้วยตัวคั่นที่ระบุ และจัดเรียงตามลำดับที่กำหนด
tr: Dosya adını kullanıcı tarafından belirtilen bir ayraçla parçalara bölebilir ve belirtilen sıraya göre yeniden düzenleyebilirsiniz.

# descriptionTransliterate
source: Transliterate characters according to predefined specifications, including converting characters to upper or lower case, converting between character sets, or converting characters to phonetic equivalents.
ar: قم بتحويل الحروف وفقًا للمواصفات المحددة مسبقًا، بما في ذلك تحويل الأحرف إلى الأحرف الكبيرة أو الصغيرة، أو تحويلها إلى أشكال نصية مختلفة أو إلى أنظمة كتابة مختلفة.
de: Konvertieren Sie Zeichen gemäß einer vordefinierten Norm, einschließlich Groß- oder Kleinschreibung, verschiedenen Textvarianten oder verschiedenen Schreibsystemen.
es: Convertir caracteres según las especificaciones predefinidas, incluida la conversión a mayúsculas o minúsculas, a diferentes variantes de texto o a diferentes sistemas de escritura.
fr: Convertir les caractères selon une norme prédéfinie, notamment en majuscules ou en minuscules, en différentes variantes de texte, ou en différents systèmes d'écriture.
it: Converte i caratteri in base a una specifica predefinita, inclusa la conversione in maiuscolo o minuscolo, in diverse varianti di caratteri o in diversi sistemi di scrittura.
ja: 指定された仕様に従って文字を変換します。大文字や小文字への変換、異なる文字バリアントへの変換、別の文字体系への変換などが含まれます。
pt: Converter caracteres de acordo com uma especificação predefinida, incluindo converter para maiúsculas ou minúsculas, converter para diferentes variantes de texto ou converter para diferentes sistemas de escrita.
th: แปลงตัวอักษรตามรูปแบบที่กำหนด เช่น เปลี่ยนเป็นตัวพิมพ์ใหญ่หรือตัวพิมพ์เล็ก
tr: Önceden tanımlanmış bir standarta göre karakterleri değiştirin, büyük veya küçük harfleri değiştirin, farklı metin varyantlarına veya farklı yazı sistemlerine dönüştürün.

# descriptionTruncate
source: Remove or keep the specified part of the filename, starting from one designated position to another.
ar: قم بإزالة أو الاحتفاظ بجزء محدد من اسم الملف ابتداءً من الموقع المحدد إلى الموقع المحدد الآخر.
de: Entfernen oder behalten Sie einen bestimmten Teil des Dateinamens, von der ersten bis zur zweiten angegebenen Position.
es: Eliminar o mantener una parte del nombre del archivo, desde un punto de inicio hasta un punto final especificados.
fr: Supprimer ou conserver une partie spécifiée du nom de fichier, de la première position spécifiée à la seconde position spécifiée.
it: Rimuove o mantiene solo una parte specificata del nome del file, da una posizione di inizio a una posizione finale specificate.
ja: ファイル名の指定された部分を削除または保持し、指定された位置から別の指定された位置までの内容を取得します。
pt: Remover ou manter uma parte especificada do nome do arquivo, de uma posição especificada a outra.
th: ตัดหรือเก็บเฉพาะส่วนที่กำหนดของชื่อไฟล์
tr: Dosya adının belirli bir kısmını silin veya koruyun, belirli bir konumdan başlayarak başka bir konuma kadar.

# bg
source: Bulgarian
ar: البلغارية
de: Bulgarisch
es: Búlgaro
fr: Bulgare
it: Bulgaro
ja: ブルガリア語
pt: Búlgaro
th: ภาษาบัลแกเรีย
tr: Bulgarca

# me
source: Montenegrin
ar: المونتينيغرين
de: Montenegrinisch
es: Montenegrino
fr: Monténégrin
it: Montenegrino
ja: モンテネグロ語
pt: Montenegrino
th: เมอร์เซเดีย
tr: Karadağca

# mk
source: Macedonian
ar: المقدونية
de: Mazedonisch
es: Macedonio
fr: Macédonien
it: Macedone
ja: マケドニア語
pt: Macedônio
th: มาซีโดเนีย
tr: Makedonca

# mn
source: Mongolian
ar: المنغولية
de: Mongolisch
es: Mongol
fr: Mongol
it: Mongolo
ja: モンゴル語
pt: Mongol
th: มองโกเลีย
tr: Moğolca

# ru
source: Russian
ar: الروسية
de: Russisch
es: Ruso
fr: Russe
it: Russo
ja: ロシア語
pt: Russo
th: รัสเซีย
tr: Rusça

# sr
source: Serbian
ar: الصربية
de: Serbisch
es: Serbio
fr: Serbe
it: Serbo
ja: セルビア語
pt: Sérvio
th: เซอร์เบีย
tr: Sırpça

# tj
source: Tajik
ar: الطاجيكية
de: Tadschikisch
es: Tayiko
fr: Tadjik
it: Tagiko
ja: タジク語
pt: Tadjique
th: ทาจิกิสถาน
tr: Tacikçe

# ua
source: Ukrainian
ar: الأوكرانية
de: Ukrainisch
es: Ucraniano
fr: Ukrainien
it: Ucraino
ja: ウクライナ語
pt: Ucraniano
th: ยูเครน
tr: Ukraynaca

# fileManagerSortButton
source: Sort by
ar: فرز الملفات
de: Dateien sortieren
es: Ordenar archivos
fr: Trier les fichiers
it: Ordina file
ja: ファイルの並べ替え
pt: Ordenar arquivos
th: เรียงลำดับไฟล์
tr: Dosyaları Sırala

# fileManagerStorageButton
source: Select storage
ar: تحديد التخزين
de: Speicher auswählen
es: Seleccionar almacenamiento
fr: Sélectionner le stockage
it: Seleziona memoria
ja: ストレージの選択
pt: Selecionar armazenamento
th: เลือกพื้นที่จัดเก็บ
tr: Depolama Alanını Seç

# fileManagerSaveButton
source: Add selections to the list
ar: إضافة الملفات المحددة إلى القائمة
de: Ausgewählte Dateien zur Liste hinzufügen
es: Agregar archivos seleccionados a la lista
fr: Ajouter les fichiers sélectionnés à la liste
it: Aggiungi i file selezionati alla lista
ja: 選択したファイルをリストに追加
pt: Adicionar arquivos selecionados à lista
th: เพิ่มไฟล์ที่เลือกเข้าสู่รายการ
tr: Seçilen Dosyaları Listeye Ekle

# fileManagerBackButton
source: Back
ar: عودة
de: Zurück
es: Volver
fr: Retour
it: Indietro
ja: 戻る
pt: Voltar
th: ย้อนกลับ
tr: Geri

# semanticsFileManagerTitle
source: {selectStatus, select, true{Selected} false{Unselected} other{}} {entityType, select, File{File} Directory{Folder} Link{Link} other{File system entity}}, filename is {filename},
ar: {selectStatus, select, true{المحدد} false{غير المحدد} other{}} {entityType, select, File{ملف} Directory{دليل} Link{رابط} other{كائن في نظام الملفات}}، الاسم: {filename}،
de: {selectStatus, select, true{Ausgewählt} false{Nicht ausgewählt} other{}}{entityType, select, File{Datei} Directory{Verzeichnis} Link{Verknüpfung} other{Dateisystemobjekt}} mit dem Namen {filename},
es: {selectStatus, select, true{Seleccionado} false{No seleccionado} other{}}{entityType, select, File{archivo} Directory{directorio} Link{enlace} other{objeto del sistema de archivos}} con nombre {filename},
fr: {selectStatus, select, true{Sélectionné} false{Non sélectionné} other{}}{entityType, select, File{fichier} Directory{répertoire} Link{lien} other{objet du système de fichiers}} nommé {filename},
it: {selectStatus, select, true{Selezionato} false{Non selezionato} other{}}{entityType, select, File{file} Directory{directory} Link{link} other{entity}} chiamato {filename},
ja: {selectStatus, select, true{選択中の} false{選択されていない} other{}}{entityType, select, File{ファイル} Directory{ディレクトリ} Link{リンク} other{ファイルシステムオブジェクト}}、ファイル名は{filename}、
pt: {selectStatus, select, true{Selecionado} false{Não selecionado} other{}}{entityType, select, File{arquivo} Directory{diretório} Link{link} other{objeto do sistema de arquivos}} chamado {filename},
th: {selectStatus, select, true{ไฟล์ที่เลือก} false{ไฟล์ที่ไม่ได้เลือก} other{อ็อบเจ็กต์ในระบบไฟล์}} ชื่อไฟล์คือ {filename} และ
tr: {selectStatus, select, true{seçili olan} false{seçili olmayan} other{}}{entityType, select, File{dosya} Directory{dizin} Link{bağlantı} other{dosya sistem öğesi}}, adı {filename}.

# semanticsFileManagerSubtitle
source: last modified at {last}, sized {size}.
ar: آخر تعديل كان في {last}، الحجم: {size}.
de: Zuletzt geändert am {last}, Dateigröße: {size}.
es: Última modificación: {last}, Tamaño: {size}.
fr: Dernière modification : {last}, Taille : {size}.
it: Ultima modifica il {last} e di dimensioni {size}.
ja: 最終更新日は{last}、ファイルサイズは{size}です。
pt: Última modificação em {last}, tamanho do arquivo {size}.
th: แก้ไขล่าสุดเมื่อ {last} ขนาดไฟล์ {size}
tr: En son değiştirilme zamanı {last}, dosya boyutu {size}

# semanticsFileManagerDirSubtitle
source: last modified at {last}.
ar: آخر تعديل كان في {last}.
de: Zuletzt geändert am {last}.
es: Última modificación: {last}.
fr: Dernière modification : {last}.
it: Ultima modifica il {last}.
ja: 最終更新日は{last}です。
pt: Última modificação em {last}.
th: แก้ไขล่าสุดเมื่อ {last}

# semanticsDropdownButton
source: This is a dropdown button, current value is "{value}", double click to open the it and pick another value.
ar: هذا زر منسدل، القيمة المحددة الآن هي '{value}'، انقر مرتين لفتح الزر المنسدل واختيار قيمة أخرى.
de: Dies ist eine Dropdown-Schaltfläche. Die aktuelle Auswahl ist "{value}". Doppelklicken Sie, um das Dropdown-Menü zu öffnen und eine andere Auswahl zu treffen.
es: Este es un botón desplegable. La selección actual es "{value}". Haz doble clic para abrir el menú desplegable y seleccionar otro valor.
fr: Ceci est un bouton déroulant, la valeur actuelle est "{value}", double-cliquez pour ouvrir et sélectionner une autre valeur.
it: Attualmente selezionato "{value}". Tocca due volte per aprire il menu a discesa e selezionare un valore diverso.
ja: これはドロップダウンボタンです。現在選択されているのは「{value}」です。ダブルクリックしてドロップダウンボタンを開き、別の値を選択します。
pt: Este é um botão suspenso. O valor selecionado atualmente é "{value}". Dê um duplo clique para abrir o menu suspenso e selecionar outro valor.
th: นี่คือปุ่มลดลง ที่ตอนนี้เลือกคือ "{value}" กดสองครั้งเพื่อเปิดปุ่มลดลงและเลือกค่าอื่น
tr: Bu bir açılır düğmedir, şu anda seçili olan '{value}', başka bir değer seçmek için çift tıklayın.

# semanticsRuleDropdownButton
source: . Select and then click the "Add Rule" button to add this rule.
ar: . حدد هذا الخيار وانقر على زر 'إضافة قاعدة' لإضافة هذه القاعدة
de: . Wählen Sie es aus und klicken Sie auf die Schaltfläche "Regel hinzufügen", um diese Regel hinzuzufügen.
es: . Selecciónalo y haz clic en "Agregar regla" para agregar esta regla.
fr: . Sélectionnez cela et appuyez sur le bouton "Ajouter une règle" pour ajouter cette règle
it: . Seleziona questa voce e premi il pulsante "Aggiungi regola" per aggiungere questa regola
ja: 。この項目を選択し、「ルールを追加」ボタンをクリックしてルールを追加します。
pt: . Selecione isto e clique em "Adicionar regra" para adicionar esta regra
th: เลือกแล้วคลิกปุ่ม "เพิ่มกฎ" เพื่อเพิ่มกฎ
tr: . Bu seçeneği seçin ve kural eklemek için 'Kural Ekle' düğmesine tıklayın
